[
    {
      "name": "GI Joe: Wrath of Cobra",
      "title": "Retro side-scrolling beat 'em up",
      "path": "GIJoe",
      "fileName": "",
      "onlineUrl": "",
      "hasPromoVideo": "https://www.youtube.com/watch?v=zWeUrH3g4AU&ab_channel=IGN",
      "techStack": "#Unity  #Multiplayer #Playstation #XBOX #PC",
      "description": "<p>Cobra is a retro side-scrolling beat 'em up. Play as one of the legendary G.I. JOE characters, including Duke, Scarlett, Roadblock, Snake Eyes, and more. Defeat hordes of Cobra troopers, Vipers, Crimson Guards and more of Cobra's malevolent machinations..</p>"
    },
    {
      "name": "S.P.A.C.E",
      "title": "Spatial Performance Assessment for Cognitive Evaluation",
      "path": "Space",
      "fileName": "",
      "onlineUrl": "",
      "hasPromoVideo": "https://youtu.be/Eisi_upeKg4",
      "techStack": "#Unity  #AI #Localization",
      "description": "<p>'S.P.A.C.E' aka Singapore Explorer is an innovative simulation designed using Unity that I developed for the Singapore-ETH Centre. Based on research conducted by esteemed PhDs from Singapore Eth and aimed to detect varying degrees of cognitive impairment in patients suffering from dementia. Designed to incorporate a range of spatial tasks that effectively assess different aspects of a player's spatial knowledge.</p> <p>The aim of the simulation is to test the player's ability to monitor their trajectory in the environment relative to the start location point to different locations in the environment. The game is available on iPad and has been developed keeping in mind the requirements of the target audience.</p> <p>Demonstrates my expertise in game development and my ability to design solutions that cater to specific needs. In my role as Development Lead, I was responsible for managing a team of three highly-skilled mid-level developers. One of the most critical challenges I faced was communicating and comprehending the research findings and incorporating them to produce an immersive and interactive game experience.</p>"
    },
    {
        "name": "DuelX",
        "title": "2D multiplayer board game",
        "path": "DuelX",
        "fileName": "Duel X.apk",
        "onlineUrl": "",
        "hasPromoVideo": "",
        "techStack": "#Unity  #Multiplayer  #AI  #WebGL",
        "description": "<p>Its a 2d multiplayer board game developed for Mobile (iOS and Android), Browsers (HTML5) for mobile and PC. It is an educational number game, helping students advance in multiplication and memorization of tables.</p>"
    },
    {
        "name": "The Lost Conquerors",
        "title": "3rd person action Zombie Shooter",
        "path": "LConquerors",
        "fileName": "",
        "onlineUrl": "",
        "hasPromoVideo": "https://youtu.be/OfXjIj2aJ24",
        "techStack": "#UnrealEngine  #BehaviourTrees #TPS #PC",
        "description": "<p>I successfully completed my university's Final Year Project (FYP) utilizing Unreal Engine 4. The project focused on creating immersive third-person shooting mechanics and an advanced AI system using behavior trees. I designed and implemented responsive shooting controls, aiming mechanics, and satisfying feedback to deliver an engaging player experience. Additionally, I developed an AI system with behavior trees that allowed AI-controlled characters to exhibit human-like behaviors such as taking cover, flanking, and coordinating attacks. Throughout the project, I adhered to industry-standard practices, optimized performance, and conducted playtesting sessions to ensure a polished and enjoyable gameplay experience.</p> <p>My university FYP project demonstrates my proficiency in game development and showcases my ability to design and execute complex projects within defined timeframes. By successfully implementing third-person shooting mechanics and an advanced AI system using behavior trees, I showcased my technical skills in Unreal Engine 4 while delivering an immersive and dynamic gameplay experience. This project is a testament to my passion for game development, my commitment to industry standards, and my ability to solve complex technical challenges in order to deliver high-quality projects.</p>"
    },
    {
        "name": "Prison Break: Jail Escape Game",
        "title": "3D Third person Stealth Game",
        "path": "PrisionBreak",
        "fileName": "",
        "onlineUrl": "https://play.google.com/store/apps/details?id=com.ffg.alcatraz.jailbreak.prison.escape",
        "hasPromoVideo": "",
        "techStack": "#Unity  #TPS #Android",
        "description": "<p>'Prison Break: Jail Escape Game' is a thrilling third-person stealth game that challenges players to break out of a high-security prison using their wits and cunning. Developed using Unity for Android</p> <p>As a player, you'll take on the role of a prisoner who is determined to escape from prison and gain their freedom. To do so, you'll need to complete a series of challenging missions that require you to navigate through the prison's various levels, avoiding guards and other obstacles along the way.</p>"
    },
    {
        "name": "Special Ops FPS Gun Strike 3d",
        "title": "3rd person action shooting",
        "path": "SpecialOps",
        "fileName": "",
        "onlineUrl": "https://play.google.com/store/apps/details?id=com.was.cover.shooter.critical.strike.force",
        "hasPromoVideo": "",
        "techStack": "#Unity #TPS #Android",
        "description": "<p>3rd person action shooting game that is perfect for fans of the shooter genre. Developed using Unity.</p> <p>players take on the role of a special ops agent tasked with completing a series of challenging missions. With a variety of weapons at their disposal, players must use their tactical skills and quick reflexes to take down enemy forces and complete objectives.</p>"
    }
]