[
    {
      "name": "Singapore Explorer",
      "title": "Spatial Performance Assessment for Cognitive Evaluation",
      "path": "Space",
      "fileName": "",
      "onlineUrl": "",
      "hasPromoVideo": "1",
      "techStack": "#Unity  #AI",
      "description": "<p>'SPACE' is an innovative game designed using Unity that I developed for the Singapore-ETH Centre. This project was based on research conducted by esteemed PhDs from Singapore Eth and aimed to detect varying degrees of cognitive impairment in patients suffering from dementia. Designed to incorporate a range of spatial tasks that effectively assess different aspects of a player's spatial knowledge.</p> <p>The aim of the game is to test the player's ability to monitor their trajectory in the environment relative to the start location point to different locations in the environment. The game is available on iPad and has been developed keeping in mind the requirements of the target audience.</p> <p>The project 'SPACE' demonstrates my expertise in game development and my ability to design solutions that cater to specific needs. It highlights my skills in Unity development and showcases my ability to develop games that have a positive impact on society.</p>"
    },
    {
        "name": "DuelX",
        "title": "2D multiplayer board game",
        "path": "DuelX",
        "fileName": "Duel X.apk",
        "onlineUrl": "",
        "hasPromoVideo": "0",
        "techStack": "#Unity  #Multiplayer  #AI",
        "description": "<p>Its a 2d multiplayer board game developed for Mobile (iOS and Android), Browsers (HTML5) for mobile and PC. It is an educational number game, helping students advance in multiplication and memorization of tables.</p>"
    },
    {
        "name": "Prison Escape Game 2020: Grand",
        "title": "3D Third person Stealth Game",
        "path": "PrisionBreak",
        "fileName": "",
        "onlineUrl": "https://play.google.com/store/apps/details?id=com.was.grand.prison.escape.plan.jailbreak",
        "hasPromoVideo": "0",
        "techStack": "#Unity",
        "description": "<p>'Prison Escape Game 2020: Grand' is a thrilling third-person stealth game that challenges players to break out of a high-security prison using their wits and cunning. Developed using Unity for Android</p> <p>As a player, you'll take on the role of a prisoner who is determined to escape from prison and gain their freedom. To do so, you'll need to complete a series of challenging missions that require you to navigate through the prison's various levels, avoiding guards and other obstacles along the way.</p>"
    },
    {
        "name": "Special Ops FPS Gun Strike 3d",
        "title": "3rd person action shooting",
        "path": "SpecialOps",
        "fileName": "",
        "onlineUrl": "https://play.google.com/store/apps/details?id=com.was.cover.shooter.critical.strike.force",
        "hasPromoVideo": "0",
        "techStack": "#Unity",
        "description": "<p>3rd person action shooting game that is perfect for fans of the shooter genre. Developed using Unity.</p> <p>players take on the role of a special ops agent tasked with completing a series of challenging missions. With a variety of weapons at their disposal, players must use their tactical skills and quick reflexes to take down enemy forces and complete objectives.</p>"
    }
]